#include <iostream>
#define MAX 1000000000
using namespace std;

//길이가 x이고 끝자리의 수가 y인 계단수의 개수를 d[x][y]에 저장
long long d[101][10];

int main() {
	int n;
	cin >> n;
	for (int i = 1; i < 10; i++) {
		d[1][i] = 1;
	}
	for (int i = 2; i <= n; i++) {
		for (int j = 1; j < 9; j++) {
			d[i][j] = (d[i - 1][j - 1] + d[i - 1][j + 1]) % MAX;
		}
		d[i][0] = d[i - 1][1];
		d[i][9] = d[i - 1][8];
	}
	long long ans = 0;
	for (int i = 0; i < 10; i++) {
		ans = (ans + d[n][i]) % MAX;
	}
	cout << ans << "\n";
}

// 1 2 3 4 5 6 7 8 9
// 10 12 21 23 32 34 
//43 45 54 56 65 
//67 76 78 87 89 
//98 

//101 121 123 210 212 
//232 234 321 323 343 
//345 432 434 454 456
//543 545 565 567 654 
//656 676 678 765 767 
//787 789 876 878 898 
//987 989

//x : ***9 : 1 1 2 3
//y : ***0 : 1 1 2 4
//d(i) = (d(i - 1) - x - y) * 2 + x + y
//	= 2 * d(i - 1) - x - y